tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/constant/massSourceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      massSourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    source1
    {
        active          true;
        timeStart       0.2;
        duration        2.0;
        selectionMode   points;
        volumeMode      absolute;
        fieldData
        (
            (H2O 1e-4) // kg/s
        );
        points
        (
            (2.75 0.5 0)
        );
    }
);

// ************************************************************************* //
